///////////////////////////////////////////////////////////////////////

// const arr = [10, 20, 30, 50, 235, 3000, 500, 200, 100];
// for (var i = 0; i < 9; i++) {
//     if (arr[i].toString()[0] === "1" || arr[i].toString()[0] === "2" || arr[i].toString()[0] === "5") {
//         console.log(arr[i])
//     }
// }

//////////////////////////////////////////////////////


// var colors = {
//     green:'Зеленый',
//     red:'Красный',
//     yellow:'Желтый'
// }
// var color = prompt('Введите цвет светофра')
// if (color === colors.red) {
//     alert('Стоп')
// }
// else if (color ===colors.yellow){
//     alert('Ожидайте')
// }
// else if (color===colors.green){
//     alert('Вперед')
// }
// else {
//     alert('Введите цвет')
// }
/////////////////////////////////////////////////


// for (var i = 20; i >= 0; i--){
//     console.log(i)
// }

//////////////////////////////////////

// var numArr = []
// for (var i = 0; i <= 10; i++) {
//     numArr.push(i)
//
// }
// console.log(numArr)
////////////////////////////////////////////////
